{"id": "1jw2g6y", "title": "A Black American writer, disillusioned by modern Black writing", "body": "The work that is pushed into the main vein of literature and awarded always seems to be... sad, reflective of a time that the writer did not live through. There are so many grand struggles that just scream \"help me\". While I have penned a few strictly African American-themed works (a short historical fiction about slave catchers, gentrification, the like...), those are the pieces that always get published. When I wrote about love or grief or laughter or lady bugs...when I am vague about WHO wrote the poem, it's not relevant in most sectors.\n\nDo any of you feel that way? Are people (all people) actually tired of the struggling Black artist trope? Is it normal to feel like if I'm not writing about being from the hood, or my grandma's Sunday cooking, a church, or what I can't have because I'm white, I won’t get the recognition other Black writers get. These themes do nothing for me, they actually discourage me from writing. But I won't stop. My poetry is of me, and I am Black, but that's not all I am.\n\nEDIT: Ive seen America Fiction a bunch of times. Obviously it spoke to me. But it didn’t answer the question of how to navigate through it. Do you just keep going and you’ll hook some scholarship or grant or teaching position that won’t make you focus on examining the n-word or Baptist churches lol It’s almost as if you have to write 2x as well about global topics than to just shart out something about your struggle for the white people to nod and tear up at lmao excuse my candor ", "created_utc": 1744303369.0, "author": "Positive_Deer", "subreddit": "literature", "score": 916, "num_comments": 309}
{"id": "1jpovcl", "title": "Once canonical authors who are now forgotten", "body": "Are there any authors who were once canonical but who are now forgotten, yet whose work you enjoy and recommend? I always love discovering these forgotten writers.\n\nI was recently reading the works of Walter Savage Landor, a poet and prose writer who was a contemporary of the romantic poets but lived until almost 90 years of age. He was best known for his *Imaginary Conversations* (between men of letters and statesman) in his lifetime; today, if remembered at all, it is for his short poems. Many of his contemporaries couldn't stop showering him with superlatives. Swinburne (himself now little read) said he \"had won himself such a double crown of glory in verse and in prose as has been worn by no other Englishman but Milton\". Dickens said his name was \"inseperably associated ... with the dignity of generosity; with a noble scorn of all littleness, all cruetly, oppression, fraud, and false pretence.\" John Cowper Powys: \"De Quincey and Hazlitt seemed dreamers and ineffectual aesthetes compared with this Master Intellect.\" Ernest de Silencourt: \"As a writer of prose none has surpassed him.\" George Moore asked if he wasn't \"a writer as great as Shakespeare, surely?\" (surely!). Who reads him now? Funny how reputations change.\n\nDo you know any other writers like Landor, now forgotten who were once canonical and are worth seeking out? Why did their reputations falter? ", "created_utc": 1743601409.0, "author": "Outrageous-Prize3157", "subreddit": "literature", "score": 308, "num_comments": 306}
{"id": "1jzvzj1", "title": "Have you ever read a work that struck you as more brutal or sexual than you ever would have guessed?", "body": "Have you ever picked up a book with no real expectations, but were nonetheless surprised by its violence, sexuality, or anything else of a disturbing nature? I read East of Eden every couple of years and I still pick up things I hadn’t noticed before. Steinbeck’s works are by and large layered like a comedian who tells his best jokes when people are still laughing from the last one. I do remember it being a lot more brutally violent and sexually disturbing than I expected it to be when I read it first as a freshman. ", "created_utc": 1744733848.0, "author": "hillslikewhitetears", "subreddit": "literature", "score": 306, "num_comments": 362}
{"id": "1k1i9yg", "title": "Just finished The Death of Ivan Ilyich. God that's gonna stay with me for a while", "body": "I had absolutely no idea where this book was going halfway through it, but I still reaaally enjoyed the way it showed the ups and downs of Ivan's life, his expectations and his constant anger at imperfections.\n\nThen the downfall starts, and it never stops.  It just keeps going.\n\nDid not expect for those final 20-30 pages to hit emotionally on a 100 page \"Classic\" book. \n\nNow I gotta rethink what really matters.", "created_utc": 1744910287.0, "author": "Kataratz", "subreddit": "literature", "score": 273, "num_comments": 37}
{"id": "1jyv0og", "title": "I can't believe how incredible Ray Bradbury's short stories are", "body": "Every single one I read ends up blowing me away. I've only read ten of them and they have all been phenomenal so far. I am so excited to get into his longer works.\n\nBtw, his short stories I would rate 10/10 are:\n\nThe Twilight greens\n\nThe murder\n\nThe fog horn\n\nAll summer in a day\n\nA sound of thunder\n\nAre there any other short stories by him that you recommend?\n\nEdit: Definitely gonna read the Martian chronicles since everyone is hyping it up so much.", "created_utc": 1744624230.0, "author": "ripterrariumtv", "subreddit": "literature", "score": 262, "num_comments": 42}
{"id": "1js5teq", "title": "What are you reading?", "body": "What are you reading?", "created_utc": 1743866430.0, "author": "sushisushisushi", "subreddit": "literature", "score": 236, "num_comments": 858}
{"id": "1k7iss0", "title": "Are we past the age of major literary theories?", "body": "\nIt feels like we’ve reached the end of the road when it comes to groundbreaking literary theories - at least in the way structuralism, deconstruction, psychoanalysis, and postcolonialism once reshaped how we read texts. Most major frameworks seem fully developed, debated, and, in many cases, absorbed into academic and cultural analysis\n\nIs literary theory in a post-theoretical era, where we're just remixing existing paradigms? Or are we simply overdue for the next major shift?\n\nWhat do you think the next wave of literary theory might look like? Or has theory hit its natural ceiling, and we’re just doing commentary on commentary from here on out?\n\nCurious to hear from people who’ve been thinking about this.", "created_utc": 1745581220.0, "author": "Fableford", "subreddit": "literature", "score": 218, "num_comments": 105}
{"id": "1k2ynt6", "title": "What are you reading?", "body": "What are you reading?", "created_utc": 1745076034.0, "author": "sushisushisushi", "subreddit": "literature", "score": 196, "num_comments": 665}
{"id": "1jnsn2y", "title": "Anyone Else Read The Recent Gatsby Article In The New York Times?", "body": "Here I am, in bed, lights off, phone at my face. Opened the New York Times app, swiped over to the literature section. There’s an article about F. Scott’s Fitzgerald’s The Great Gatsby, I select it. Because I want to know, need to know. How could there possibly be anything new to say about the book and its author? A few paragraphs down, I come across this:\n\n“When he published “The Great Gatsby,” Fitzgerald was more than just a famous writer; he was a celebrated generational voice, the Sally Rooney of his time.”\n\nI felt my face bunch up. Its corners bunching into my nose, like the earths crust bunching into mountains.\n\nAnybody else cringe upon reading the Rooney comparison? \n\n\n", "created_utc": 1743386624.0, "author": "Acuriousbrain", "subreddit": "literature", "score": 185, "num_comments": 111}
{"id": "1jnjlzy", "title": "From which author have you read ALL of their works?", "body": "What drew you to the author's writing?  \nDid you plan it from the start? Or did it just happen?  \nAre all books high quality or are there letdowns?  \nIn retrospect, was reading all their works time well spent?", "created_utc": 1743360908.0, "author": "horigen", "subreddit": "literature", "score": 171, "num_comments": 481}
{"id": "1k227oz", "title": "Where do we place Larry McMurtry?", "body": "McMurtry used to wear a sweatshirt that said “minor regional writer.” But, he said, only two American writers were not minor: Faulkner and Flannery O’Connor. That was his standard of greatness. \n\nIn the current issue of NYRB Thomas Powers argues that Lonesome Dove (1985) was a great book. He says it rises above others to “explain a culture to itself, help people to know what matters”.  Though he thinks it will take another 50 years to know for sure. Your thoughts?", "created_utc": 1744974174.0, "author": "edbash", "subreddit": "literature", "score": 143, "num_comments": 76}
{"id": "1jz23zr", "title": "Why should I read instead of scroll on my phone? Struggling with internet use and want change.", "body": "I know this question might sound ridiculous, but I ask it out of a genuine desire to change my habits. I am absolutely, insanely addicted to my phone. I’m talking upwards of ten hours a DAY. It’s bad and has become more than a conscious choice. Apps like this, Insta and TikTok have hijacked my brain, and I’m desperate to get it back.\n\nThe issue is that compared to these infinite scroll apps, reading a book does not feel nearly as good. And believe me, I know how anti-intellectual that sounds and shameful that might be to admit. But in order to replace my copious phone use with reading, I need reasons to read, because the dopamine from my phone is just so powerful and compelling. I don’t need strategies to reduce my phone use like Screen Time limits or putting my phone in a different room. These strategies haven’t worked, because alternative pastimes are not nearly as dopamine-inducing, so I always end up resorting to my impulses. I need to actively want to read more than I want to use my phone, which requires understanding reading’s unique advantages over my phone’s biggest, which is how good or sedated it makes me feel. I literally have a book in front of me right now but can’t tear myself away from my phone.\n\nCould you please help me understand why I should read more when I could just depend on my phone for easy dopamine? What am I missing out on that outweighs this dopamine?\n\n", "created_utc": 1744645573.0, "author": "Puzzled_Cherry_5613", "subreddit": "literature", "score": 138, "num_comments": 146}
{"id": "1jmq835", "title": "I just finished reading \"Grapes of Wrath\"", "body": "Not a native speaker, but I've read it in original language\n\nReading it felt like slowly drowning in mud, it was getting more and more overwhelming and it never stopped\n\nThe book was raw and honest and left me dazed and a little bit broken \n\nSteinbeck perfectly broke down the mathematics of greed and fear and how it can grind down almost everything that is really valuable \n\nIt was especially hard to read from a perspective of a person that doesn't have a big family or circle of friends\n\nMaybe that's me that cannot extract more hope from this piece, but it was very grim, especially from a perspective of today's world, in which almost 100 years later the same struggles continue and the freedom of land, local agriculture and traditional family life is almost extinct \n\nJust my thoughts, peace to everyone ", "created_utc": 1743266072.0, "author": "Najzyst", "subreddit": "literature", "score": 138, "num_comments": 36}
{"id": "1k8vd7g", "title": "What is the best fantasy you have read in terms of quality of prose?", "body": "Fantasy has always been a genre near and dear to my heart, but I've come to realize in the past few years that a lot of fantasy is poorly written, at least stylistically. The bulk of its canon falls so easily into tropes, cheap writing, corny characters, and conflict between worldbuilding and narrative. Given how closely linked Science Fiction and Fantasy, it seems like both genres encounter similar problems, but I find that even SF as a genre features more high-quality prose.\n\n  \nWhat are some fantasy books you all consider to be both excellent representations of the genre and quality prose?\n\nPersonally, I just re-read A Wizard of Earthsea and, as always, Le Guin never fails to awe me, so much so that I ordered the three sequels (which I have not read) to dive more deeply into her fantasy prose.   \n", "created_utc": 1745726997.0, "author": "igilix", "subreddit": "literature", "score": 145, "num_comments": 128}
{"id": "1k8i79o", "title": "Rereading Hamlet made me realize how much I’ve grown", "body": "I know Hamlet is a classic, and when I first read it in my early years of high school, I have to admit... I didn’t fully get it. I felt a little immature back then. I just couldn’t focus deeply on what the lines were really saying, and it just felt like a complicated old story to me.\n\nRecently, I decided to pick it up again, and this time I really took my time with each line. I tried to focus on the true meaning behind the words. And honestly, I felt such a deep connection to it. I saw so much more emotion, pain, and truth in Hamlet’s struggles. It’s like the words finally clicked with me.\n\nThe famous \"To be or not to be\" soliloquy especially struck me... not just as a philosophical question, but as a raw, deeply personal reflection on existence. It made me ponder how the choice to continue living, despite suffering, is itself an act of courage. What once seemed like a purely academic speech then, now feels like one of the most sincere expressions of human vulnerability in all of literature. It REALLY made me wonder about the strength it takes just to *be*.\n\nThis experience made me realize that some works reveal their power only when we are ready to receive them. Hamlet hasn't changed... I have!", "created_utc": 1745688196.0, "author": "WiseMentor2946", "subreddit": "literature", "score": 136, "num_comments": 18}
{"id": "1jx2m3p", "title": "A Fictional Timeline of Great American Novels", "body": "edit: spelling\n\nRegardless of your thoughts on global literary canon or what the true \"Great American Novel\" is, there are a number of reasonable candidates that capture important aspects of the character and sentiments of the United States throughout its history. I had this idea recently as a cool reading list, but as I started putting it together it got impractically long. I tried to add most titles that have some level of critical consensus, but also added some of my own picks. Would love suggestions on additions/removals or date changes (I haven't read too many of these and am certainly missing some)!\n\n1640s: The Scarlet Letter, Nathaniel Hawthorne\n\n1750s: The Last of the Mohicans, James Fenimore Cooper\n\n1760s-1780s: Mason& Dixon, Thomas Pynchon\n\n1830s-1860s: Absalom, Absalom!, William Faulkner\n\n1840s: Moby Dick, Herman Melville  \n1840s: Blood Meridian, Cormac McCarthy  \n1840s: The Adventures of Huckleberry Finn, Mark Twain\n\n1850s: Uncle Tom's Cabin, Harriet Beecher Stowe\n\n1860s: Little Women, Louisa May Alcott  \n1860s: The Red Badge of Courage, Stephen Crane\n\n1870s: Beloved, Toni Morrison\n\n1900s-1920s: The Sound and the Fury, William Faulkner\n\n1900s-1930s: U.S.A. trilogy, John Dos Passos\n\n1920s-1940s: The Adventures of Augie March, Saul Bellow\n\n1920s: The Great Gatsby, F. Scott Fitzgerald  \n1920s: Gentlemen Prefer Blondes, Anita Loos  \n1920s: The Sun Also Rises, Ernest Hemingway\n\n1930s: The Grapes of Wrath, John Steinbeck  \n1930s: To Kill a Mockingbird, Harper Lee  \n1930s: Light in August, William Faulkner  \n1930s: Invisible Man, Ralph Ellison\n\n1940s: Gravity's Rainbow, Thomas Pynchon  \n1940s: The Amazing Adventures of Kavalier and Clay, Michael Chabon  \n1940s: Catch-22, Joseph Heller  \n1940s: The Bluest Eye, Toni Morrison  \n1940s: On the Road, Jack Kerouac\n\n1940s-1970s: Slaughterhouse-Five, Kurt Vonnegut\n\n1940s-1990s: The Brief Wondrous Life of Oscar Wao, Junot Díaz\n\n1950s: The Catcher in the Rye, J.D. Salinger  \n1950s: Lolita, Vladimir Nabokov  \n1950s: Rabbit, Run, John Updike\n\n1950s-1990s: Underworld, Don DeLillo\n\n1970s-2000s: A Visit from the Goon Squad, Jennifer Egan\n\n1980s: American Psycho, Bret Easton Ellis\n\n2000s: Infinite Jest, David Foster Wallace  \n2000s: Freedom, Jonathan Franzen", "created_utc": 1744410927.0, "author": "bubbadog4595", "subreddit": "literature", "score": 119, "num_comments": 76}
{"id": "1k969cb", "title": "I don't understand anti-libraries. Do you?", "body": "I stumbled upon the notion of an \"anti-library\" a few months ago and I don't see the point of it (I'm anti- anti-library). Why would you build up a large collection of books that you haven't read on topics you don't understand? It seems that the answer is \"to remind you of all that you don't know\", but I don't think it's hard to have that understanding and simply keep it in your mind. I just try to be humble about my knowledge and intellect.\n\nI've spent the last few months trying to simplify my life and have sold off a lot of my possessions that don't excite me anymore, and the idea of having a bunch of unfamiliar books occupying a bunch of space gives me a headache. It seems antithetical to utilitarianism or usefulness, just drowning in possessions. At what point would you stop acquiring unfamiliar books? If I'm going to burden myself with material objects, I want them to be things that I know I enjoy, so I don't need to worry about whether I should have them or not. What do you think? If you hold a contrary position on anti-libraries, I'm curious to read your thoughts.", "created_utc": 1745766857.0, "author": "cable1138", "subreddit": "literature", "score": 112, "num_comments": 76}
{"id": "1jreodp", "title": "Why do people critique books by saying things like “the author conveniently killed this character” or “they didn’t mention this person because it would’ve ruined the plot”? Isn’t that the whole point of writing a story?", "body": "It really frustrates me when people say a book isn’t well-written because a character conveniently dies and sets off the entire plot — as if the writer didn’t intentionally make that happen. Or when someone asks where a character’s family is and others reply, “They weren’t mentioned because they’d ruin the plot.” Exactly! The writer chose not to include them because they’d break the story.\n\nDo people not realize that fiction is constructed around the plot? That leaving out “ideal conditions” or irrelevant people is part of storytelling — because a plot full of neat, realistic logistics would be boring?\n\nIs this just a difference in how people read fiction or am I unable to identify bad writing? Curious how others think about this.\n\nAlso I'm not very sure if this is the correct subreddit for this conversation but I thought you guys must get attached to books as much as I do too so you might have an insight on this.", "created_utc": 1743780517.0, "author": "Parallelobisquois", "subreddit": "literature", "score": 91, "num_comments": 75}
{"id": "1k219dz", "title": "Just read Wuthering Heights", "body": "Oh boy. I did not expect to be this engaged. Haven't had the time to sit down and read a solid piece of literature in a while. The characters were so flawed and I had to pause after they many any decision. I really enjoyed this.\n\nI know there was no main antagonist but God I wanted to beat Heathcliff up. The way he disappeared for 4 years and came back to destroy Catherins peace after she was finally a bit sane.\n\nNot to mention he had the audacity to wed Catherine's sister in law to further anger Edgar (her husband). He had been thinking of revenge all this time. And don't even get me started on the chapter titled \"trap\"\n\nCatherine must have been rolling in her grave knowing Heathcliff was physically abusing her own daughter and forcing her to marry his son to secure wealth. What kind of a selfish love was that.\n\nEdgar was tbh was a bit weak of a character despite being one of the least flawed. He was a good husband but tolerated too much of Catherine's nonsense. Ik circumstances were dire but letting her lover come into the picture after 4 years and then ur daughter marrying ur wife's lovers son only to be abused. \n\nCatherine was so impulsive and definitely had pretty privilege hence the line that went smth like \"Catherine's smile was so sweet and her face so beautiful that it was hard not to accept her apology\". \n\nPoor isabella. ", "created_utc": 1744970467.0, "author": "Firm-Ad-5855", "subreddit": "literature", "score": 85, "num_comments": 33}
{"id": "1juzvq6", "title": "Literature's greatest wholesome characters", "body": "I have developed a habit to deal with grieve or other intense situations by reading some paragraphs about my favorite wholesome characters in literature. So far I have used the dialogues revolving around Atticus Finch (To kill a mockingbird), Samuel Hamilton (East of Eden) and Joe Gargery (great expectations) to help and guide me when I'm at a loss.\nWhich other wholesome and caring characters would you recommend to me?", "created_utc": 1744182948.0, "author": "ElContador69", "subreddit": "literature", "score": 85, "num_comments": 119}
{"id": "1k5dpga", "title": "Do you finish literary fiction that you don’t like?", "body": "I’ve been having this discussion with one of my friends lately about whether or not we finish books we don’t like. For example I just finished up the Naked Lunch by William S.Burroughs a novel which I knew within the first few chapters I was not going to enjoy. However, I feel like I learn just as much about myself and the world around me by analyzing why I might not enjoy a book or how my thoughts differ from those of the author so I like to power through and reflect on it. My friend on the other hand just DNFs anything she realizes she doesn’t like. I’ve done this with a few books now like Naked Lunch, Wuthering Heights, and Things Fall Apart. So I’m curious which approach other people take, and which classics you guys haven’t liked? ", "created_utc": 1745346632.0, "author": "Kodak328", "subreddit": "literature", "score": 86, "num_comments": 208}
{"id": "1k6lnll", "title": "(Why) are schools seems to occupy much more prominent place in British literature?", "body": "I am reading \"Never let me go\", and I feel like this is a reoccurring theme that people are defined by their school much more than by later life experiences. \n\nI feel, like this notion permuates British literature/art in general, but I can't think of many examples besides Harry Potter.\n\nDo you think my observations is right? What is the reason then?\n\nOr it's just two books about childhood and they do not constitute any trend? ", "created_utc": 1745476866.0, "author": "elephant_ua", "subreddit": "literature", "score": 77, "num_comments": 56}
{"id": "1k6t9j0", "title": "Pretentiousness vs victimhood, the controversial development of literary criticism", "body": "[ This might be a controversial one, so feel free to delete if inappropriate, but I personally think this topic is rather important. Disclaimer: I am female and love any and all genres of literature, *including* romance novels. ]\n\nI have found that ever since reading got more and more popular on tiktok (which I wholeheartedly approve of) there has also been a rise of taking literary criticism as a personal offence, especially when it comes to romance novels.\n\nTo the point that you can barely criticise popular romance novels without your review being called pretentious or downright misogynistic because *how dare you* criticise something that happens to be enjoyed by mostly women.\n\nI get that people who claim \"all romance is the same\", \"booktok is only smut\", etc etc are disrespectful to the genre, people do seem to love hating on certain authors without ever having read any of their work, *but* I personally am also struggling to see nuance on the romance lover side of the spectrum.\n\nWhen you say that a particular novel is badly written, or you dislike the quality of a certain author's writing based on reading you have actually done, you get attacked. You're *hating for no reason*, and especially if you're a male reviewer you might get called misogynistic. As if the romance genre was a magical safe space protected by any and all (valid) criticism. \n\nThe criticism of specific works of literature is neither a personal attack, nor an attack on a whole gender. Just like there is no need to judge people who enjoyed certain books you disliked for having \"low standards\" and enjoying something \"easy\".\n\nI feel like the literature community on social media has just become more and more hostile to rewiewers overall, in both directions and it's tiring to even have strong opinions without wanting to fight off allegations of being *hostile*. (I do like a healthy discourse/discussion, but many conversations are neither healthy, not productive anymore).\n\nWhere is the nuance?", "created_utc": 1745504007.0, "author": "iced-matcha-books", "subreddit": "literature", "score": 79, "num_comments": 32}
{"id": "1joxqm3", "title": "Just finished reading Heart of Darkness.", "body": "Maybe it's just me but this seems like a very loaded text which may take two to three reads in order to be grasped correctly. There were some very harrowing imageries which did feel like reflections of the human soul. Pardon me if I have misinterpreted it as Conrad's writing style was a bit challenging to follow.\n\nAlthough I have been involved in postcolonial discourses for a while, HoD still felt like a very fresh take on this topic. The colonisers as well as the colonised, both were given a human side. Though it did feel like Conrad was somewhere in the middle when it came to colonialism(at least in this book). He did critique the inhumane way of looking at the natives and how there were completely dehumanised but at the same time, it felt like he was also going a bit easy on the colonisers. I felt that there was a lack of dichotomy as, at times, it seemed like the colonisers and the colonised were on the same boat(lol) when it came to the psychological torture they had to face. On one hand, the wild nature of the Dark Continent understandably toyed with the sanity of the white men for whom, this tropical place was akin to hell; while on the other hand, the Africans were barely seen as humans and their culture completely disregarded(which was understandable since the novella was written from the perspective of a white man). A lot more can be said about this book when a dialogue is established regarding its themes and ideas. Maybe I would need to read it again to gain an even deeper understanding of the ideas conveyed here but on my first read, these were my thoughts about it.\n\nPlease share your thoughts on this book. I would like to discuss more about it!", "created_utc": 1743519661.0, "author": "Daevito", "subreddit": "literature", "score": 73, "num_comments": 38}
{"id": "1joi0e9", "title": "Giovanni's Room", "body": "I've just read this novel for the first time; it's devasting and one of the most crippling depictions of isolation that I've ever read.\n\nI just had a question regarding David's bisexuality: was it merely a facade? Although it's undeniable that he ultimately rejects Giovanni due to his internalized shame and guilt that he associates with homosexuality and it seems that his foray into heterosexuality is merely a cover for his true desire, but is it all a cover? I do get the vibe that he was genuinely attracted to Hella and in some sense desired the family life, or were these merely lies that he was using to self-deceive his true intentions? I know the book is about self-deception (not only with David, but definitely with his father), but it does seem that at least some of his heterosexuality was not acting.", "created_utc": 1743465299.0, "author": "CartographerDry6896", "subreddit": "literature", "score": 74, "num_comments": 9}
{"id": "1jymdij", "title": "Why are 18th Century Writers Less Popular than 19th and 20th ones, at least the Novelists?", "body": "So hello. I posted a thread here a little while ago asking after the academic reception of DH Lawrence and now I have a similar question. As a layman, it's hard to grasp what the \"trends' are beyond my own small experience. I'd love to know what people with higher education or who work in higher education can tell me on this.\n\nI've always loved the Romantics - the big six. (which I'm learning were only relatively recently canonized) But I started to wonder \"where did they come from?\" Blake and the rest of them did not poof into being from nothing. I like philosophy too so of course I knew Rousseau and his influence on the Romantics.  But as I am just perusing through books, articles, Wikipedia, I start reading about the Sentimental Novel. I start learning names like Samuel Richardson, who Rousseau loved.\n\nBut it's a name I've never heard before. I'm not claiming to be super informed but even the average person might recognize names like Charles Dickens, George Eliot, Jane Austen.... Hell, they'd recognize William Blake who was right there at the tail end of the 18th Century. But Richardson, Henry Fielding, these are apparently two towering figures in 18th Century literature that I don't recognize one bit.\n\nAre they as semi-obscure as I think? If so, is this mainly a popularity thing? Are they studied in academia?\n\nMy impression is, if they are studied in academic circles today, not nearly as much as the 19th and 20th Century literary figures. You could drown in monographs and companions to the figures I named, and then you get into early 20th Century British writers who are also very famous, and 19th Century Russian novelists like Tolstoy and Dostoyevsky that basically everybody knows. I can barely find much of anything specifically dedicated to Richardson (who has piqued my interest) and what I have found is decades old.\n\nSo yeah, appreciate any insight more learned folks here can give me while I start my reading of Pamela.", "created_utc": 1744591029.0, "author": "NikkolasKing", "subreddit": "literature", "score": 73, "num_comments": 38}
{"id": "1jqkzzy", "title": "I really wanted to love The Overstory, but it lost me completely", "body": "I went into this book *really* wanting to love it as an avid hiker and nature lover after hearing about it so much. The first third was great. The character introductions were interesting, the writing was solid, and if that section had just been its own novella, I think it would’ve been perfect. But once that part is over, the book completely loses the plot.\n\nFor one, it is **way too long for how little actually happens**. It has one message, \"*trees are special, everything is connected\"* and it just repeats that over and over without adding anything new. By the halfway point, it starts to feel like Powers is just beating you over the head with it instead of actually exploring the idea in a meaningful way.\n\nThen there’s the **characters**, who all talk in the exact same weirdly lofty, unnatural way, like they’re just mouthpieces for the author instead of real people. And some of their transformations don’t feel earned at all. Some of the characters becoming eco-terrorists make sense, like Douglas the Vietnam vet with nothing to lose and a deep connection to trees from the war, but then there's characters like Mimi who seemingly just sees a patch of trees across from her office be cut down one day and immediately begins chaining herself to trees in the middle of the woods and participating in massive protests with barely any internal struggle. The book just skips the part where some of them actually *change* and expects us to roll with it. It's like Powers knew that he had to get characters from \"point A\" to \"point B\", but didn't put nearly enough effort in actually making it a believable transition.\n\nAnother issue I had was the cartoonishly evil villains. Every person who isn’t a tree-loving activist is basically a soulless corporate monster. There’s zero nuance, zero attempt to show the complexity of environmental issues—it’s just “good guys vs. bad guys” in the most simplistic way possible. The book never evolves beyond the depth of a Captain Planet episode.\n\nAlso, the dialogue. **Nobody talks like this.** Gabriel Popkin’s review highlighted this issue perfectly with this actual conversation from the book, between a Vietnam vet and a guy he met at a seedy dive bar playing pool:\n\n“Who’re you planting for?”  \n“Whoever pays me.”  \n“Lotta new oxygen out there, because of you. Lotta greenhouse gases put to bed.”\n\nWhat? Just because someone says *\"lotta\"* instead of *\"lot of\"* doesn’t mean you get to pretend that’s how an actual pool shark at a dive bar speaks. Every character, regardless of their background, speaks in this weird, stilted, pseudo-profound way. And then, of course, if they’re a \"bad guy,\" they turn into straight-up Bond villains, twirling their mustaches and delivering lines about how they’ll burn down as many orphanages as it takes just to make an extra buck.\n\nI really *wanted* to like this book. I kept hoping it would evolve or build on its early promise, but it just got more repetitive, more heavy-handed, and honestly, kind of exhausting. I get why some people love it, but for me, it ended up feeling more like a lecture than a story.", "created_utc": 1743693080.0, "author": "ThrowawayStolenAcco", "subreddit": "literature", "score": 73, "num_comments": 57}
{"id": "1jsajxa", "title": "I read Pride and Prejudice for the first time and I loved it", "body": "I didn’t come in with high expectations and it was a slow burn to start, but after that I could barely put it down.\n\nThe development of the characters and of the storyline is perfect. Personally, I have no background of the British aristocracy and their mannerisms in the 1800s. Yet, I never felt I needed it. This is a story of family, status, and love that is relatable to any person of any generation.\n\nEven with the flowery, meandering dialog, every character feels so real. Who doesn’t know someone like a Mrs. Bennett or a Mr. Collins? This isn’t to say they are stereotypes; they are just fully fleshed out and relatable, even to the modern day. They are weird; they are oblivious; they are hilarious.\n\nThe title is perfect. Darcy is mostly prideful but also prejudiced. Elizabeth is mostly prejudiced but also prideful. To realize their faults, they make mistakes with each other, they point it out to each other, they listen to each other, and they finally try to make it up to each other. Together, they grow past their pride and their prejudice to find happiness. Their connection doesn’t develop because they are the same, or because they are perfect, but because they learn to fit together like two jagged puzzle pieces. This is a perfectly satisfying and timeless story", "created_utc": 1743878927.0, "author": "zotboi", "subreddit": "literature", "score": 64, "num_comments": 15}
{"id": "1k1mkla", "title": "reading Gravity’s Rainbow", "body": "i just wanted to post that i am currently 40 pages into Gravity’s Rainbow, started reading it about a week and a half ago, so really pacing it slowly… but I am astounded by this book. I love PTA’s Inherent Vice film, I love poetry and great writing and sort of dizzying psychedelic transcendental philosophy mixed with emotional ache, so I guess it’s not the biggest surprise I’m into this but…\nI’ve tried reading his V. before and couldn’t really sink my teeth into it, I wanna say I made it about a hundred pages in, I’ve read a bit of Lot 49 and remember moderately liking it but feeling kind of ambivalent towards it interest-wise, but this, I mean, wow. It has that kind of mythical daunting stature/reputation to it as being sort of one of the great challenges/achievements of “a book you should read before you die, IF YOU CAN HANDLE IT!” so I really braced myself going in, and yes, the breadth is definitely a large order, and yes it is very dense, but I don’t think I have EVER actually ENJOYED the time consuming, focus demanding complexity of a novel’s dense verbosity page by page. I mean holy shit every fucking page has worlds of thoughts emotions jokes reflections recollections personalities opinions etc etc etc and it is written in such a beautifully poetic way. And I am literally just coming off of Joyce’s Portrait of the Artist which I deeply appreciated on a personal level but ended up so annoyed by his meandering poetics. I guess Pynchon does offer a lot more to be entertained by with the merry go round of the pot smoker’s paranoiac ADHD encyclopedia brain zinging and jumping everywhere, but I don’t know, I do see a similarity in them in that you’ll immediately lose your sense of where you are, who you’re following and what’s going on if you skim over even a sentence or two because of how poetic and flighty their language sort of carries you through time and space moving you through the plot without you really noticing the transitions. I feel that while Joyce is literally doing on the nose autobiography, it’s Pynchon whose mind I end up feeling so much closer to, his language, thoughts and fixations and tangents more boldly outlining the shape of his vision.", "created_utc": 1744920985.0, "author": "RutabagaOk4020", "subreddit": "literature", "score": 63, "num_comments": 27}
{"id": "1jtxxlj", "title": "Do you look at reviews before picking up a book?", "body": "\nI always check reviews before buying a book, but it often leaves me confused. Sometimes, I find polarizing reviews on Goodreads that say a book is a waste of time when I enjoyed it while other times, I see highly praised reviews on BookTube and I hate it. I struggle to know when to trust reviews, especially since I have to buy books out of pocket because my local library doesn’t have a wide selection of English books (Germany). This makes the decision-making process difficult.\n\nSo, I’m curious to know what you all do.", "created_utc": 1744064130.0, "author": "Confusedmind75", "subreddit": "literature", "score": 62, "num_comments": 83}
{"id": "1jxqxjb", "title": "What am I missing in Brothers Karamazov?", "body": "Life changing, best book ever written, you will never be the same again after reading this - that's what I've heard and read about this book. Finished it today after 3 months of struggling through and I just don't get it. And I don't mean it in snarky, annoyed way, I truly honestly don't get what I have missed and I would love for someone to explain to me how this book can change someone's life.\n\nI don't mind slow pace, I don't mind allegorical characters, I don't mind philosophical disputes. If anything, I would love for this book to dive more deeply into some ideas, to sell them to me or at least explain in ways I could actually question my own beliefs or at least enrich them. That's why I feel like I must be missing something important here.\n\nTo be fair, I am an atheist, not spiritual, do not believe in an idea of redemption through suffering or carrying other people's guilt throughout one's life. I'm fine with author presenting different ideas from mine, I would actually love being forced to question my own assumptions and beliefs. But I felt I've just been presented with the idea that differs from mine and that's all. Presented numerous times, repeating the same thing over and over without changing the perspective or adding anything new.\n\nI liked the passage about free will in Grand Inquisitor, but truly this could have been standalone story and is totally separate from the rest of the book. And still, however interesting the thought, it wasn't that groundbreaking either, and still it was the highlight of the novel. The rest - no morality without God, redemption of depravity or redemption through forgiveness just didn't click with me, and not for a moment I felt the argument for them was presented well enough for me to analyze them in good faith. Actually, I didn't feel any argument was presented at all, the idea was just put there and here you go. That's what I mean when I say I'd love for the book to actually go deeper into some ideas, so I could feel anything other than \"nope, do not agree\".\n\nDo you need to be spiritual/believer for this book to be life changing or this unbelievable masterpiece people are raving about? Or am I just totally dumb and missed something important? I might as well be, but I'd appreciate pointing out what exactly I have missed.\n\nAh, and I'm 33 years old, in case anyone would like to argue I'm too young for this, I've seen this argument in other threads.", "created_utc": 1744490647.0, "author": "Terrible_Vermicelli1", "subreddit": "literature", "score": 61, "num_comments": 110}
{"id": "1jqx3pj", "title": "Who else went downhill from their debut?", "body": "*Appointment in Samarra* is such a fantastic book, after which O’Hara published 16 novels which never again measured up.\n\n(His short stories, of course, remained great.)\n\nWhat other literary novelist comes to mind who (a) kept publishing novels throughout their life but (b) none ever matched the achievement of their debut?", "created_utc": 1743721555.0, "author": "rhrjruk", "subreddit": "literature", "score": 55, "num_comments": 70}
{"id": "1k4lh6c", "title": "On the Opposite Treatment of Sex in Orwell's 1984 and Huxley's Brave New World", "body": "I read Brave New World in high school and it was, what I would consider, my first \"classic dystopian\" novel. In the same grade I'd read Orwell's Animal Farm but that was it for him. A few years later I found myself with a garage sale copy of 1984 and wanted to give it a read. \n\nI'm halfway through 1984 and it has been an amazing read, but it's revealed a stark contrast to the other 20th century dystopia I noted above. In 1984 there is a strict adherence to sexual abstinence and promiscuity within the Party is all but dead as sex has been reduced, ideally, to nothing but a chore, if possible with a twinge of disgust added. As for Brave New World it couldn't be a more distinct approach with everything from drug-fueled orgies to the nullification of monogomy. \n\nBut both are means to the same end, control. This was an interesting difference in approach that I had to share and see what other people thought. Thank you for your time and looking forward to reading your ideas!", "created_utc": 1745261835.0, "author": "Questioning_Fractals", "subreddit": "literature", "score": 53, "num_comments": 22}
{"id": "1jsk1gv", "title": "Favorite piece of literature that you encountered “accidentally”?", "body": "I remember watching Lovecraft Country and hearing Sonia Sanchez’s poem “Catch the Fire” and I fell in love with it. \n\nWhat’s your favorite piece that you weren’t looking for? ", "created_utc": 1743906679.0, "author": "Normal-Being-2637", "subreddit": "literature", "score": 51, "num_comments": 77}
{"id": "1k56tzq", "title": "Favourite writers anyone? Why?", "body": "My favourite writers at at the moment are jeffrey eugemides (the virgin suicides) and donna tartt (the secret history, the little friend, the goldfinch)\nRealist narrators, not a bad line or dissonant sentence in them I can recall, I think a lot of good writers write prose that is largely irrelevant to the narrative integriry \n\nI think the russian authors of the 19th century are overrated, I've read dostoyevsky's crime and punishment, the devils, the idiot, the brothers karamazov, the double, notes from undergroiund, the eternal husband, white nights, poor folk, the gambler- he's definitely worthy of esteem and his books are readable but, I don't rate him in my top 3- objectively his work is the greatest in literature, creates discrete characters and have them develop in respect to each other, which is clairvoyant, a 6th sense you can't learn\n\nI've read war and peace by tolstoy and death of ivan ilyich, very good, but\n\nI've read Ivan Turgenev's fathers and sons on the beach in corsica 25 years ago\n\nI also like james joyce and oscar wilde because they're Irish, Joyce started with conventional english in dubliners, different techniques in a portrait of the artist as a young man, more cryptic with ulysses, and outright unintelligible with finnegans wake, a lecturer in ucd, the university joyce attended, said there were two types of readership, those who pretend to read it and those who read it to pretend, joyce said it took him 17 years to write finnegans wake so it should take his readers 17 years to read it, I was at a show in the local theatre where a guest lecturer said there was an academic who intended to translate finnegans eake into languages other than english, he quipped you'd have to translate it into english first, ", "created_utc": 1745329912.0, "author": "aodhanjames", "subreddit": "literature", "score": 50, "num_comments": 107}
{"id": "1k6xkm3", "title": "On this day in 1815, Anthony Trollope was born. What is your favorite novel, series, short story or biographical fact about Trollope?", "body": "\nHAPPY BIRTHDAY TO MY MAN TONY!\n\n**My favorite biographical facts:**\nWhen he was young, he worked for the British postal service. While there, he INVENTED THE MAIL BOX in 1852. \n\nAs a writer, he wrote by very strict, self-imposed rules. Every day he woke early, and before heading out to perform his postal duties, he wrote. He wrote 250 words every 15 minutes, pacing himself with a watch. \n\nHenry James once wrote an absolutely SCATHING review of \"The Belton Estate\" (\"a stupid book, without a single thought or idea in it ... a sort of mental pabulum\"), but then later wrote an entire essay about how great Trollope was at details (\"Trollope will remain one of the most trustworthy, though not one of the most eloquent, of the writers who have helped the heart of man to know itself.\") \n\n*Side note - I am so glad not to have been born into a time when Henry James was able to review my work, he could be SO MEAN.*\n\nHis autobiography is low-key a little bit boring unless you are looking for advice on how to write (his way), and then it's really interesting. \n\n**My favorite stand-alone novel:**\n \"The Way We Live Now\", which remains a relevant social commentary to this day. If you are unfamiliar with Trollope, and like Dickens's \"Our Mutual Friend\", you'll love TWWLN. \n\nA close second is \"He Knew He Was Right\" - Trollope himself thought it was a bit of a fail, that the title character was unsympathetic. But it is one of the most moving and tragic fictions about mental illness I have ever read. \n\n**My Favorite Series:**\n(I know there are only two, I still have a favorite.)\nThe Chronicles of Barsetshire. My friends enjoy teasing me about how invested I am in a series that revolves around the lives of Clergymen, but I am quick to fill them in on the latest read, and they agree, these Clergymen LIVE for messy drama.  I have not been able to bring myself to read the final book, \"The Last Chronicle of Barset\", because I am not ready for the story to end. \n\nTrollope's characters are complex. His stories have twists and turns but always end in a place that seems reasonable and fair. He created a rich, reality-based world for his Palliser and Barsetshire characters. His is funny. His books are \"easy\" reads; always fun, often a bit educational, and always deeply engrossing. I read him because his stories are, above all else, ENTERTAINING. And I love to be entertained. \n\nYou can join The Trollope Society (I'm a member here) or The Trollope Society of America if you want to connect with other Trollopians. The Trollope Society's current read is \"The Claverings\". ", "created_utc": 1745514502.0, "author": "SentimentalSaladBowl", "subreddit": "literature", "score": 47, "num_comments": 30}
{"id": "1k4dve3", "title": "Exposition in magical realism?", "body": "I’ve only read a couple books in the genre: the two most obvious ones, One Hundred Years of Solitude, and The House of the Spirits, and I have been wondering this for a while now. Why do these books tend to favor exposition, rather than the typical (at least in North America) way of writing, that old adage of “show don’t tell”? It doesn’t turn me off, not even a little bit—in fact, it helps me to sink deep into the story, rather than being asked to imagine every single action every character is taking (i’m pretty sure I have aphantasia, so I don’t really have a mind’s eye).\n\nSo yeah, that’s my question: what’s that about? How did that come to take root?", "created_utc": 1745243061.0, "author": "Capital_Bluejay7006", "subreddit": "literature", "score": 45, "num_comments": 26}
{"id": "1k8oveb", "title": "What's the most boring book you've read this year and why?", "body": "For me it's The Willow King by Meelis Friedenthal.\n\nVery boring but it did leave a strong impression. I've read it in my native language, it's translated as The bees, and I think that the English title suits it better and it probably has an impact on the overall feeling.\n\nThe story has few loose ends and it bothers me. On the plus side, the reader can get a good idea of what was like to live in the 17th century.", "created_utc": 1745706230.0, "author": "svemirska_krofna", "subreddit": "literature", "score": 43, "num_comments": 193}
{"id": "1k5z5nq", "title": "The Third Reich by Roberto Bolaño", "body": "Bolaño is one of my favourite writers. The Savage Detectives,2666,By The Night In Chile and Nazi Literature In The Americas all of these are magnificent and some of the best books I have read. The way he writes about history, literature, Latin America, Violence and Melancholy is extremely distinct,profound and memorable. Susan Sontag famously called him one the most influential novelist of his time and I whole heartedly agree. It's undeniable that vee few writers of his generation have that sophistication, humour and excitement. I have mostly read him translated but still he is a better writer than most untranslated writers. That being said....\n\nI think I really didn't like The Third Reich.\n\nThe Third Reich concerns Udo Berger, a German wargame champion, obsessed with a strategy game called the third reich,who returns with his girlfriend Ingeborg to the small town on the Costa Brava where he spent the summers of his childhood. There he meets another german couple and slowly things start to change and very enigmatic and somewhat dangerous characters are introduced. One of which, El Quemado(literally meaning The Burnt) is a mysterious pedal bote lender who is covered with burns. Udo eventually becomes obsessed with this character and starts playing the game with him while strange things start to happen.(I am leaving a lot of details for spoilers)The story is somewhat of a simple thriller but has a lot of the Bolaño staples. Including, Sinister characters who are in the background pulling the strings,dreams and nightmares, strange deaths whose causes are never resolved and of course themes of obsession and etc. Bolaño is really good at creating atmosphere and interesting characters and I would admit that this book also has a lot of that, which really reminded me of movies of David Lynch and Kiyoshi Kurosawa and I also felt a huge influence of Kafka's The Castle,but sadly that couldn't really salvage the book.\n\nMy biggest complain against The Third Reich, would be it's pacing and it's characters. It's only 282 pages but it almost took me an eternity to finish it and the charactes, albeit being interesting, are really under developed. I also think themathically it's also somewhat incoherent. It's trying to say something about the nature of Obsession and Europe's History and the nature of dehumanisation of people through games/fascism. But I don't really think it really is able to say any of those things very well or atleast with the same power or perspicacity as Bolaño's other books. Bolaño wrote The Third Reich in 1989 and didn't publish it in his lifetime. It was later discovered in his papers and published in 2011 and I can't help but think that he was also aware of the weaknesses of the book and it wouldn't have been a terrible thing if it was never published. Overall I think if you are a die hard Bolaño fan like me you should definitely give it a shot but if you are someone who is not familiar with Bolaño or doesn't swear by his name then you could definitely ignore this one. Overall a very atmospheric,well written but ultimately forgettable minor work.", "created_utc": 1745414852.0, "author": "LeadershipOk6592", "subreddit": "literature", "score": 39, "num_comments": 17}
{"id": "1jspf7m", "title": "Thoughts on Ian McEwan?", "body": "I recall reading Saturday some years ago and not particularly enjoying it, finding the denouement somewhat absurd and the character of Henry to be a bit spineless. I believe I watched the film Atonement at around the same time and remember finding the character of Briony so abhorrent that even now I struggle to rewatch it.\n\nRecently I've been greatly enjoying Martin Amis, both due to the quality of his prose and the meta-textual elements in his work. Given the friendship between the two authors I've been wondering how they compare stylistically and what peoples thoughts on McEwan are. ", "created_utc": 1743927828.0, "author": "Ferryman-12", "subreddit": "literature", "score": 38, "num_comments": 46}
{"id": "1jw1rr3", "title": "Satantango", "body": "God...my god. After reading this if you are an atheist you could turn into a religious person or if you are a religious person you could turn into an atheist. So bleak. Also so fucking funny. I felt like shit laughing at people living in the most terrible circumstances possible. Probably the most depressing book I have ever read. Coming from someone who reads a lot of depressing books this almost defeated me. I am a huge fan of the movie and generally consider Bela Tarr to be in my top 5 movie directors. I knew it's going to be depressing but I didn't think it's going to be more depressing than the movie itself. Just filled with a genuine dread of death and the apathy of universe. Your life was a cosmic mistake by a god who refusea to look at his own creation and your life would be spent with a hope of false salvation. The systematic dismantling of basic human goodness by state sanctioned dissolution of individualism and a beuracratic nightmare that doesn't know how humans work. The constant description of people getting drunk,stink of mud and sewers and muddy road. The damped and cracked walls,the food that is stale,the constant rumination on death and the possibility of reasoning in this joke of an universe where these characters are mostly wet birds who even fail to fuck or dance without an anxiety of a great catastrophe that even they don't know what would bring. Everything turns into a meaningless thing for transaction and personal gain. Even religion dissolves into something alien to the people at the most edge of society and it's meaning forgotten. The apathy and neglect of adults fail everything: a nation,a village,a hope of salvation and a little girl. You think things might change but you realise everything is connected and is designed in a way that is impossible to change and people are what they are; poor,scared and drunk on something to ignore the suffering. A bad joke that starts and ends in a bad way.I might sound like I am lying but I genuinely think parts of it are more bleak than Samuel Beckett and José Saramago and,if you have read Unnamable or Blindness then you would know it's a fucking achievement to do that. A character commits suicide and you feel that's the best thing they could have done to get out of the pain and suffering. You know everything is just going to get worse for most people. I genuinely think that the movie is much more digestible at times. Take the scene of the headmaster dancing with mrs.Schimdt,in the book it's very funny and very ironic in contrast,the scene in the movie is actually very tender and really draws out the humanity in these characters.(I also missed vig mihaly's soundtrack in that scene not gonna lie) Also it's beautifully written. The translation by George Szirtes and Ottile Muzilet is an absolute masterpiece. I wish I could read it in Hungarian. I am also not sure that overall the book is critical of religion or is more critical of the sacrilege of religion in modern world through means of authoritarianism. I also don't understant the significance of The scene where Esti's deadbody is seen rising to heaven by the boys In the movie it was very confusing and I finally understand it what happened in that scene after reading the book. But still am a bit confused about the greater symbolism of that scene. I also think that overall it's a book that could be called anti-prophet more than anti-god like I have seen some people describe it. The Kafka quote at the start,I will miss the thing by waiting for it istrying to say that humanity misses god's true intention and beauty by it's own inherent corruption and hope of a false utopia and it leads to even suffering losing all it's meaning and substance(?). I also think that the ending tries to show the endless cycle of humanity where the book starts and ends with the same words(the ending is genius btw) bit is also kind of not bleak because it shows that atleast someone was able to get out of the Satanic Tango and was able to look at the Tango without participating in it. I just have so many questions and thoughts about this book. I really need to reread it. But before that I need to read something light like Jane Austen or Marcel Proust. I really wonder how Laszlo Krasznahorkai is not someone who committed suicide. Dude actually seems pretty chill for someone who wrote this. I would really appreciate it if someone could tell me if I am missing some Hungarian symbolic or historical context with the narrative. If you haven't read it, please don't unless you are like me and kind of love being depressed.\n\nFavourite line of the book:\n\nHalics’s whole body felt as though it had lost definition and, as for his coat, it had lost whatever resistance to water it once had nor could it protect him from the roaring cataract of fate, or, as he tended to say, “the rain of death in the heart,” a rain that beat, day and night, against both his withered heart and defenseless organs.", "created_utc": 1744301652.0, "author": "LeadershipOk6592", "subreddit": "literature", "score": 36, "num_comments": 20}
{"id": "1jzcwxt", "title": "a question about Nazi Germany", "body": "I know that some Germans didn't know about the Holocaust, others only heard rumors and others simply didn't care, but if a German asked \"where do the Jews go?\" what answer would he possibly get? I know that most didn't care, but someone must have asked that question at some point, so what answer did he get? a simple \"they're going to Poland to work\" or \"it's none of your business\", or did they try to cover it up by saying that they were just going to work and nothing too bad would happen? (I don't know if I expressed myself very well in this question) ", "created_utc": 1744672412.0, "author": "Happy-Progress-5641", "subreddit": "Historians", "score": 345, "num_comments": 42}
{"id": "1jtbizu", "title": "2000 was the last great year", "body": "If there was ever a year I could go back to in a time machine, it would be the year 2000. Simply because it seemed like it was the last year there was a sense of innocence in American society. It all ended a year later on 9/11. Which then later led to the war on terrorism. Leading to wars in Afghanistan and Iraq. And then to make matters worse the 2008 financial crisis hapend as well as growing income inequality. As well as extreme polarization in our politics. Leading to our country getting more and more divided.\nThe year 2000 seemed to be the last year things felt normal. I was a little kid at the time but I remember kids would play at the park. Go to each other’s houses and watch movies. Me and my freinds would go skating or ride our bikes around the neighborhood. Computers were a new thing. The internet was not even 10 years old yet. Smart phones and social media so people can still get out and have fun and enjoy their lives. Seemed like if you were a young person in your 20s dating was much easier. You could just go to a bar and hook up with someone, And get their number. People don’t even do that anymore because of dating apps. And it seemed like we were more united as a country. \n\nThe division wasn’t as bad then. There was some division, especially with the election of that year between Al Gore and George Bush. However people weren’t as hooked on politics 24,7 Being a democrat or republican. It was like either being a Yankees fan or a Red Sox fan. People may be disagreed about politics, but they would still come over for dinner go out and grab a beer with them or watch a football game together. And at the end of the day we seemed to see each other as fellow Americans. Or more importantly fellow human beings. And despite political differences it wasn’t like a way of life like it is now. The things people cared the most about was there family, there children and there future, there friend’s and there work.\nAs well as trying to do well for there community. \n\nLast but not least the economy was amazing in the year 2000. Wages were still rising, it seemed to be the last year the middle class had a boom. With the continued prosperity from the 1990s. New homes and new cars were much cheaper. And yes, even though a lot of jobs in the 80s and 90s did go overseas there was still a lot of manufacturing in the United States at the time and maybe wasn’t as great as it was in the 60s and 70s. But you could still buy a decent amount of high-quality products still made in America that were new at the time. And we had a balanced budget and a budget surplus.", "created_utc": 1743995017.0, "author": "Funny_Preference_916", "subreddit": "Historians", "score": 320, "num_comments": 12}
{"id": "1jpf03x", "title": "What are the best history book you have read?", "body": "Like the question asks what are the best books you guys have read, not just from an information stnadpoint, but from how the book is written as well, becasue as most of you know how dry history books can be. ", "created_utc": 1743563661.0, "author": "FoolofaTook_Pt2", "subreddit": "Historians", "score": 316, "num_comments": 245}
{"id": "1k23v2s", "title": "Ancient lost or poorly known Civilizations", "body": "Hello everyone I’m working on a game and I would like to use Ancient poorly known Civilizations as the theme.\n\nI know this might be very subjective of course and it depends upon each one’s perspective but in my opinion I’m talking about things like the Scythians or the Olmec or the Khmer Empire or the Tiwanaku the Etruria etc… would love to get your ideas on what civilizations I could explore due to their interesting history or the fact that more people should know about it. I really wanted this game to be both fun but also educational regarding these amazing Civilizations lost to time.\n\nWould you be kind enough to share some of your wisdom with me? Thank you in advance.", "created_utc": 1744979726.0, "author": "New_Public_203", "subreddit": "Historians", "score": 66, "num_comments": 16}
{"id": "1k06w96", "title": "a question about universities in Nazi Germany", "body": "I was watching a movie and a question came to my mind: did German women at that time go to universities? How common was that? I had never really thought about it and I had never seen any movie, series, documentary or book talk much about it, so I believe that it probably did, but I think it wasn't that normal, especially in courses dominated by men at that time. But even so, what types of courses were usually targeted by women who decided to go to universities? I don't think they received degrees or were in the same classes as men, but I'll ask anyway: were they in the same classes as men? Were there courses that seemed exclusive to women because so many people entered them? \n\n(It's a weird and random question, but I really had this in my head) ", "created_utc": 1744761540.0, "author": "Happy-Progress-5641", "subreddit": "Historians", "score": 41, "num_comments": 9}
{"id": "1jxz1lz", "title": "Same knowledge, different cultures?", "body": "Having a tough time googling this. Is there a term for the emergence of similar knowledge in unconnected regions? \n\nFor example, in early history, sailing emerged (in various forms) in many different cultures, seemingly before the advent of international trade that would provide the opportunity to share ideas. Is there a name for that?", "created_utc": 1744516500.0, "author": "amhdaniel", "subreddit": "Historians", "score": 26, "num_comments": 5}
{"id": "1jxgh0l", "title": "Artist's place in history", "body": "Throughout history, artist expressed social events in their art. Some of the most emotional art has been the response of these events. Consider this. Create art that shows your feelings and anxiety with today's political nightmare.", "created_utc": 1744461897.0, "author": "Royal_Perspective321", "subreddit": "Historians", "score": 11, "num_comments": 2}
{"id": "1jql47x", "title": "Everyone died from syphilis", "body": " I was reading the book, Columbian Exchange,\" which is about the impact of the first contact with Europeans on the Americas. It has a chapter on the \"sudden worldwide emergence of syphilis.\" I learned in school Europeans (Columbus) brought it to the Americas and part of what decimated the local populations. \n\nIt states it had existed around the world but always blamed on different origins. Really it was a cluster of similar symptoms that were grouped together and called \"syphilis.\"  Actual syphilis is transmitted through sexual contact. \n\nMany historical figures have died or had insanity blamed on syphilis. This also implies they were in sexual contact with whomever or however many partners. Would it drastically change the image of some famous figures who were considered to have died from \"syphilis?\" Especially those that were sworn to be chaste but smeared as being floozies?", "created_utc": 1743693359.0, "author": "Dorothy2023", "subreddit": "Historians", "score": 10, "num_comments": 1}
{"id": "1jpazav", "title": "Some love for Eric Hobsbawm", "body": "I've finished reading the tetralogy of the \"Age of...\" series, and I'm seriously blown away by the breadth of knowledge Eric Hobsbawm had. He was often called a Marxist Historian, but I don't see (except for the last volume, Age of Extremes) where he allowed his views to color his judgement. One thing I have noticed, and maybe folks will like to add in, is that most historians tend to be narrow specialists. Richard Evans is a historian of Germany, Christopher Clark of Europe, Ian Kershaw of Hitler, Dalrymple of India and so on. I have not met the likes of knowledge that Hobsbawm had, on science, literature, the arts, economic movements and finally political movements. He was not just a narrow specialist. What a man, what a historian. Any Hobsbawm fans here?", "created_utc": 1743552309.0, "author": "modernistl9118", "subreddit": "Historians", "score": 8, "num_comments": 7}
{"id": "1k8sxyo", "title": "What did people in the 1940s believe the future would be like?", "body": "What did an average person in the 40s think the 21st century would be like? Besides flying cars, what did they think it would have? I googled it, but I didn't find much from that specific era. Does anyone know? Like something their grandparents told me or something? I'm writing a story that takes place in that era and involves time travel, please help meeee", "created_utc": 1745718739.0, "author": "Happy-Progress-5641", "subreddit": "Historians", "score": 9, "num_comments": 2}
{"id": "1jzrrv6", "title": "Oral history donation with restrictions", "body": "I recently completed an oral history project and am in the process of donating the materials to two university special collections and a private archive. I have signed release forms from all interviewees, but I’m unsure how to structure a deed of gift that reflects my intentions.\n\nThe standard form provided by each institution appears to transfer full ownership and copyright of the materials, which I’d prefer to avoid at this time. I’m still actively working on a documentary based on this project, which I plan to release by fall 2026 at the latest. To preserve my ability to use the content freely for that purpose and beyond, I would like to retain copyright.\n\nIdeally, I’d like to grant each institution a perpetual, non-exclusive license to use, display, and make the materials available for research, exhibits, media projects, or whatever they may fancy, while I maintain copyright ownership.\n\nWould it be possible to structure the donation in this way?", "created_utc": 1744723384.0, "author": "The_Stratman", "subreddit": "Historians", "score": 8, "num_comments": 1}
{"id": "1jo8nr1", "title": "Is there anyone here interested in university's history？", "body": "I am a fan of university history and I read some books about Harvard(e.g.books written by Samuel Eliot Morison) Cambridge, Oxford and so on. I am really interested in the origin of them and their crest, their anecdotes. I also made some drawings of their anthropomorphic(yes their human being mode), sometimes I feel lonely cause there is nobody around me interested in that. So I ask here.", "created_utc": 1743441758.0, "author": "laicrea", "subreddit": "Historians", "score": 7, "num_comments": 3}
{"id": "1jrco13", "title": "Can I monetize translated transcriptions?", "body": "I’m just finishing my master’s and need some side/extra income, nothing significant, just something to help me with some expenses. I like to research and transcribe XVI and XVII centuries documents from my main language. It’s something i like, can be done in my home but i have some questions about it:\n\n1- Is it legal, if the main sources are, like i said, from the XVI/XVII centuries?\n\n2- Is it ethical?\n\n3- Can it be somehow profitable, with the right promotion?\n\n4- I would pick the documents, do the transcription + translation (to english) and put them on some content creators platform.", "created_utc": 1743775444.0, "author": "honestlyhonest_", "subreddit": "Historians", "score": 5, "num_comments": 4}
{"id": "1jpdu5x", "title": "Opportunities for high schoolers?", "body": "Hi I’m considering majoring in history, but would like some more experience into what life after graduating would be like. I’ve taken and enjoyed all the history aps and have hundreds of hours doing transcription work for the library of congress. Any recommendations for somewhere I can help/volunteer without experience? It seems like a lot of the museums around me are only taking college students and I’m a little intimidated to email nearby professors (I’ll get to it). Are professors even interested in clerks?\nThank you!", "created_utc": 1743560530.0, "author": "lenasce", "subreddit": "Historians", "score": 6, "num_comments": 11}
{"id": "1k96dne", "title": "Reading Recommendations for Vietnam War History", "body": "I was interested in doing a bit of reading on the Vietnam War this summer, but I feel like everything that I've read in the past has focused on US strategy or the experiences of US soldiers. Does anyone have any reading recommendations for books that focus on the Vietnamese experience, particularly books that analyze the North Vietnamese strategy? ", "created_utc": 1745767172.0, "author": "Feeling-Sleep8892", "subreddit": "Historians", "score": 6, "num_comments": 7}
{"id": "1jnsrs3", "title": "Expanding in the field of history?", "body": "Hi everybody, \n\nI have a question regarding expanding myself in the field of history. Are there opportunities to continue expanding myself in the field of history on a global scale? I would like to travel, conduct research, publish, etc but it seems highly competitive. Right now I am a social studies teacher and am curious if anyone can shed light on this? ", "created_utc": 1743387052.0, "author": "None", "subreddit": "Historians", "score": 3, "num_comments": 2}
{"id": "1k62hj8", "title": "Source commentary", "body": "Hi, I hope this kind of question is allowed, I’m currently doing a research portfolio for a university assignment, I was just wondering, as I can’t contact any university staff about this due to it being the Easter break, if I have directly quoted from the source in the commentary do I have to footnote it?? TIA!!  ", "created_utc": 1745423230.0, "author": "Fast-Painting8379", "subreddit": "Historians", "score": 2, "num_comments": 3}
{"id": "1k7zj9y", "title": "Would a modern day crusade work", "body": "Let's say the next Pope decided to call a crusade to recapture the holy land and have a new Catholic state. 1. Would this be successful as the pope is not as powerful as he once was back in the middle ages and the desire for the holy land isn't as strong as it was. 2. Would people be willing to join and would countries also be willing to join. ", "created_utc": 1745625235.0, "author": "Glittering_Many_9159", "subreddit": "Historians", "score": 1, "num_comments": 5}
{"id": "1k11giq", "title": "Most op weapons", "body": "During medieval Japan -1185 to 1603 ish- what was the overall most op weapon. Obviously it’s hard to quantify because every weapon had a purpose, but certain ones had some glaring strength and weaknesses. Guns were the great equalizer, but could be inaccurate ect. ", "created_utc": 1744854546.0, "author": "Stormblade111", "subreddit": "Historians", "score": 1, "num_comments": 0}
{"id": "1jrz590", "title": "Was our ancestors from year 1500 stupid for believing in witches? Or do witches exists?", "body": "Was our ancestors from year 1500 stupid for believing in witches? Or do witches exists?", "created_utc": 1743842999.0, "author": "Double_Ad2691", "subreddit": "Historians", "score": 0, "num_comments": 13}
{"id": "1k30m4q", "title": "Don’t understand this sub", "body": "I started following this sub because I thought it would contain discussions of classic literature. Thoughts, feelings, interpretations. It surprises me how many posts are photos of book covers that people have purchased. I have a credit card too. Honestly what is the point?\n\nEDIT: clearly this sub is not what I imagined it was. \n\nEDIT 2: Thanks for everyone’s ideas and comments. I’m done responding to this thread. \n\nEDIT: Someone suggested r/BookClub.  I’m there and participating in a read along. It’s great!  Thanks for the suggestion! ", "created_utc": 1745081237.0, "author": "LifeHappenzEvryMomnt", "subreddit": "classicliterature", "score": 589, "num_comments": 190}
{"id": "1jo9yib", "title": "Count of Monte Cristo really is THAT good", "body": "Take this as a sign if you have been putting off reading this for forever like i have. Looks like this is my new favorite book \nThe size of the book (glad i went for the unabridged version i would have regretted it otherwise) is nothing compared to how good it is. Im going through it faster than any other book i’ve read and im genuinely so wrapped up in the plot that it feels like I’m watching a tv show to the point where i need to take a break every once in a while because i feel obsessive lol\nI get sad whenever i remember that eventually i’m going to finish it. It really is a masterpiece \n\nEdit: For anyone asking i’m reading Penguin classic’s Robert Buss translation.\nIt seems to be the one most people prefer due to its readability and completeness. ", "created_utc": 1743444868.0, "author": "gravityfallswhore", "subreddit": "classicliterature", "score": 568, "num_comments": 75}
{"id": "1jxrddx", "title": "I'm a Fraudulent English Major", "body": "About a year ago I graduated with a Bachelor's in English. I got good grades, but I didn't work as hard as I know I should have. I was able to skate by on skimming, and engaged with the material just enough to earn me my degree.\n\nI also never really landed on a focus. I took classes on Greek epics and Norse sagas and chivalric romances and political theory and everything in between. And while I'm glad to have given myself such a well rounded education, I feel like I only have a surface level understanding of a lot of things, and I wish I'd given classics the time and care they deserved when reading and learning was my \"job\" in high school and college.\n\nNow I'm graduated, working a corporate job I hate in a field I couldn't give less of a shit about, and I've come to realize that the thing I never bothered to really give my all to is what I actually care about more than anything. So here I am, with an English degree and an only perfunctory foundation of literature and literary history. I wasted the period of my life when I actually had the time to invest in the things I care about. Now I'm stuck in the 40hr grind of working life, and I want to play catch up with what little free time I have, but I honestly don't even know where to begin.", "created_utc": 1744491845.0, "author": "Parking_Eye9281", "subreddit": "classicliterature", "score": 138, "num_comments": 52}
{"id": "1jrpgup", "title": "What book are you most ashamed of not having read?", "body": "Those of us who spend time on this sub probably think of ourselves as reasonably well-read. There are certain books that any reasonably-well read person ought to have read. For English speakers, whatever you may think of these works, books like The Great Gatsby, To Kill a Mockingbird, Pride and Prejudice are books all lovers of literature should read and have an opinion about (in my opinion). \n\nFor yourself, which book or author do you feel lightly embarrassed about never having gotten around to yet?\n", "created_utc": 1743808244.0, "author": "SirJohnFalstaff1996", "subreddit": "classicliterature", "score": 123, "num_comments": 300}
{"id": "1jzwb8k", "title": "What's your favorite short story?", "body": "I'm trying to get into the habit of reading a short story before bed and looking for reccomendations. ", "created_utc": 1744734636.0, "author": "katxwoods", "subreddit": "classicliterature", "score": 96, "num_comments": 235}
{"id": "1jz139k", "title": "Would anyone like to discuss HOW literary fiction gets published today?", "body": "Reading the thread under Thanh Nguyen’s Lit Hub essay, one gets the impression that people think the entirety of US literary fiction is under critique here, when it is somewhat obvious that we are dealing with survivorship bias. It’s not that American authors have nothing particularly scorching to say about US imperialism, it is just that the publishing and review ecosystems (and, well, the economic system at large) actively select against ideologically troublesome work.   Ideas that might be considered problematic have to make it through the author’s self-censorship apparatus (financial, career, status related worries), they have to be represented by an agent (reputation worries), they have to be taken on by an editor who has to convince the publisher that the ideas are worth it, not on account of any humanistic or aesthetic notions, but because they will sell well or because they will bring a measure of prestige to the publishers based on contemporary ideological currents.\n\nGiven the strong opposition of systemic forces to any kind of radical critique, these ideas are sanded down to a palatable version of themselves well before they go into print; and if they by any chance make it through this process relatively intact, they can still be ignored or panned by the reviewing class, or left unsold by the literary fiction reading public (also a class, if a bit broader).\n\nImperfect domesticity may simply be the perfect vessel for the degree of subtleness such ideas require before they can be published by a large publisher, reviewed in legacy media, and bought by an audience.\n\nAs you scroll through the comments in that thread, seeing the defensiveness, unease and hostility towards the author, it is not difficult to see why, as these same emotions play out in the publishing process (with much higher stakes), we get the literature that we do. We’re all complicit in what we feel comfortable admitting, to others and to ourselves, about our societies.\n\nThe real problem, as I see it, is that the market for literary fiction has become so well understood by now, and the broader political environment so unforgiving to intellectual exploration of any type of otherness, that the field of acceptable expression seems to be narrowing down with each turn of the cycle.\n\nThe solution? Either a billionaire sets up a radical press and pours money into wining and dining established critics to widen the Overton window, or we will all just have to start donning our trench coats and fake moustaches, sneaking into the B & N’s and buying the most crazy newly published Big 5 books we can find with cash.", "created_utc": 1744643057.0, "author": "vertumne", "subreddit": "TrueLit", "score": 73, "num_comments": 73}
{"id": "1jmpmjr", "title": "TrueLit Read-Along - My Brilliant Friend - Prologue and Childhood", "body": "Afternoon everyone,\n\nToday we get into the actual reading of My Brilliant Friend by Elena Ferrante. Here are my discussion questions for the chapters we read this week. Please see the [reading schedule](https://www.reddit.com/r/TrueLit/comments/1jcmtbj/truelit_readalong_my_brilliant_friend_reading/) post for more details.\n\n* There’s a recurring theme of subterranean passageways, hidden things, dark impulses and suppressed emotions (specifically among women). What does this say about childhood and how violence is created? The book takes place in a very violent community with lots of outbursts and impulsivity.\n\n* How would you say this book differs from other coming-of-age novels? To me, in coming-of-age novels there’s frequently a quiet, interior protagonist and another character that acts as a romantic ideal that shapes that first person. Think Richard/Henry in The Secret History or Gene/Finny in A Separate Peace. For me what is different here is how Lila is ideal, rival and antagonist all at once. She’s pushing and sabotaging Lenu (pushing the doll into the sewer, possibly trying to get her parents to not send her to middle school) in ways you don’t normally see in this dynamic. In books like these she’s as much a symbol to the protagonist as a character and I think there’s a lot to analyze there.\n* Why do you think Lila identified so strongly with Melina (woman who went after that married guy’s wife) and Alfredo Peluso (accused of murdering Don Achille)?\n* Is Lenu in love romantically with Lila? Obviously they’re young girls but an older Lenu is narrating and clearly she’s putting an adult context on everything. Why did Lenu want Lila to give her the garland of apples that Enzo gave her? To me that was the first time I thought of Lenu’s fascination with Lila as romantic.\n* I wanna talk about accessibility in the writing style and book as a whole, for these chapters obviously, but I hope we can carry this discussion throughout the rest of the book. I feel that the book is something anyone can latch onto. If you’re looking for plot or a “salacious read” or an “easy read” the book has all that for you. But there’s also a lot of literary depth to the prose and story. This is a very popular book and was even #1 on the New York Times’ Best Books of the Decade So Far. What do you think this book’s prose and structure “say” about accessibility and literary merit? Does accessibility water down the depth of a book? Or does it really not matter, as long as the writer is being true to themselves? Do you feel that Ferrante watered down her prose at all to appeal to the market? (I did notice that the chapters are short which is a hallmark of a lot of popular fiction. I feel like you can have a surface “page-turner” read of the book: you can do that because of how quickly things happen. But if you want to stop and analyze there’s obviously a lot to analyze. But that quickness and surface plot could just be attributed to Ferrante’s style of trying to evoke memory because that’s how remembering works)  Is part of My Brilliant Friend’s enduring popularity linked to its accessibility, maybe hinting that the masses do really crave literary stories just as long as they can make sense of them?\n\nI was thinking a lot about childhood fantasy and impulsivity vs. deliberateness as I was reading and don’t have specific discussion questions related to them, but think they’re worth chewing on, both now and as we continue to read and discuss the book.\n\n# ", "created_utc": 1743264447.0, "author": "Kloud1112", "subreddit": "TrueLit", "score": 45, "num_comments": 34}
{"id": "1k5w1g9", "title": "What Are You Reading This Week and Weekly Rec Thread", "body": "Please let us know what you’ve read this week, what you've finished up, and any recommendations or recommendation requests! Please provide more than just a list of novels; we would like your thoughts as to what you've been reading.\n\n**Posts which simply name a novel and provide no thoughts will be deleted going forward.**", "created_utc": 1745405044.0, "author": "JimFan1", "subreddit": "TrueLit", "score": 34, "num_comments": 115}
{"id": "1js4hvg", "title": "TrueLit Read-Along - (My Brilliant Friend - Adolescence: Chapters 1-16)", "body": "Good morning,\n\nMy post comes earlier than most due to the different time zones, I began writing this at eight and a half in the morning (which should be around 4 am, at least for some of you guys in the US).\n\nI read this section in a day (a week or two ago), 'cause I have a long commute, so I had to re-read some parts here and there to be sure I'm not missing anything (though I'm certain that's bound to happen anyway). I stopped at chapter 18, so no spoilers for further sections. Now, onto the questions.\n\n* It's the beginning of adolescence and puberty comes crashing down on Lenù's self-esteem: she gained weight, her breasts grew, she had her first period. She's a complete mess at the start and, to make matters worse, she barely survives her first year of middle school (though, later on, her academics drastically improve). In this respect, Lenù is the complete opposite of Lila, whose decision to follow in her father's(/brother's) footsteps gives her another dream to follow, that of making and selling shoes (instead of just fixing them). What could we make of this divergence in their maturing, so far? Of Lenù's all-encompassing changes and Lila's restrained growth, the former's attempts to stay on track and become \"someone\" through her studies and the latter's apparent resignation to her family's line of work (from which she tries to derive some artistic leeway in any way she can).\n\n>I felt grieved at the waste, because I was compelled to go away, because she preferred the adventure of the shoes to our conversation, because she knew how to be autonomous whereas I needed her, because she had her things I couldn't be part of, (...) —because, in short, she would feel that I was less and less necessary. (Ch. 12)\n\n* All this leads me to another matter of puberty and adolescence: their sexual awakenings. Here, once again, violence rears its head in, for the description of encounters between girls and boys in this novel are boiling beneath the surface with struggle (be it physical, mental, or both). Lenù speaks of feeling for the first time, when she gets 10 lire from Gino for showing him her chest, \"the magnetic force\" her body exercised over men. Then, when Lila's puberty is apparent, she too becomes the object of male sexual desire, although they are perceived differently by the men around them. In short, Lenù isn't the conquest that Lila is: \"(...) men almost never addressed to her the obscenities that they almost always had for us.\" (ch. 16). This all culminates in the episode with the Solaras' brothers, when Lila mistakenly dances with a man she had threatened some chapters ago. How do you think these differences shape their perceptions of themselves and of one another? At first, Lila feels a repulsion towards Lenù's growth (in particular, her period), but, given the chance, it seems she revels in this new source of attention, while Lenù's romantic and sexual streak is way more dire (though, maybe no less objectifying).\n\nI think those two questions are the crux of this moment in the novel, so what follows are smaller points of discussion/observations (most of which go back to one or both of the ideas posed above).\n\n* Thoughts on the expansion of the cast? I enjoyed the early chapters with Carmela, perceived by Lenù as a surrogate for Lila. \"I wavered between irritation at a remake that seemed a caricature and fascination because, even diluted, Lila's habits still enchanted me.\" (ch. 2). This, in turn, evolves into thoughts about Lila as a demanding ghost, through which \"in her abscence, after a slight hesitation I put myself in her place. Or rather, I had made a place for her in me.\" (ch. 3). Although Lenù and Carmela mirror each other in this sense, the former doesn't see this \"possession\" as a kind of surrogacy (the latter's case).\n* Why would Lila invent a black creature that killed Don Achille?\n* Lenù feels embarassed about \"trying to make Lila's new passion my own\" (ch. 4), so what do you make of Lila's refusal to work with Lenù as a writer later on, as the latter's dreams of becoming a novelist are rekindled after becoming acquainted with Donato Sarratore's poetry? It could be that, putting Melina aside for a second, Lila perceives artistic pursuits of this kind fruitless or futile — unlike the shoes, that'll be worn and used by someone. At this moment, there's been a shift in the Cerullo siblings, with Rino in particular boasting about his craftsmanship and how he just needs some luck to become rich (even richer than the Solaras), which Lila seems to concur with.\n* Laughed a little at Lenù and Pasquale's exchange (ch. 9), it's the beginning of a more explicit political streak in the novel. Without giving anything away, this is furthered in the 17th chapter and I can only hope it gets expanded upon as this book (and the others) go on.\n* I almost forgot, but in the first chapter we get a glimpse into the future (though not present time) and are introduced to what Lila calls \"dissolving margins\". It occurred to me that the episode with the Solaras could've been a precursor to that, I was wondering what the others thought about this notion and how Ferrante introduced it to us.\n* People got heated last time about Ferrante's prose, in part deservedly so. Overall, it's been perfect as my \"commute book\", but outside of that context it would probably bore me a little after a while. How are things on this front?\n\nI don't have anything else to add, aside from wishing everyone a good weekend! Next Saturday, it's u/ksarlathotep's turn.", "created_utc": 1743862792.0, "author": "Woke-Smetana", "subreddit": "TrueLit", "score": 28, "num_comments": 30}
{"id": "1k0hcn9", "title": "What Are You Reading This Week and Weekly Rec Thread", "body": "Please let us know what you’ve read this week, what you've finished up, and any recommendations or recommendation requests! Please provide more than just a list of novels; we would like your thoughts as to what you've been reading.\n\n**Posts which simply name a novel and provide no thoughts will be deleted going forward.**", "created_utc": 1744800271.0, "author": "JimFan1", "subreddit": "TrueLit", "score": 27, "num_comments": 78}
{"id": "1jpljqa", "title": "What Are You Reading This Week and Weekly Rec Thread", "body": "Please let us know what you’ve read this week, what you've finished up, and any recommendations or recommendation requests! Please provide more than just a list of novels; we would like your thoughts as to what you've been reading.\n\n**Posts which simply name a novel and provide no thoughts will be deleted going forward.**", "created_utc": 1743590671.0, "author": "JimFan1", "subreddit": "TrueLit", "score": 27, "num_comments": 102}
{"id": "1jv2qga", "title": "What Are You Reading This Week and Weekly Rec Thread", "body": "Please let us know what you’ve read this week, what you've finished up, and any recommendations or recommendation requests! Please provide more than just a list of novels; we would like your thoughts as to what you've been reading.\n\n**Posts which simply name a novel and provide no thoughts will be deleted going forward.**", "created_utc": 1744195487.0, "author": "JimFan1", "subreddit": "TrueLit", "score": 25, "num_comments": 86}
{"id": "1jxc3mo", "title": "TrueLit Read-Along - (My Brilliant Friend - Adolescence: Chapters 17-30)", "body": "Hi all,\n\nSooooo it's my first time doing this and I'm not exactly sure how to go about it, so I figured I'd just start right off with some of the questions that I wondered about as I was reading this section.  \n  \n\\* 1. The dynamic between Lenu and Lila: During this section, the \"power dynamic\" - the complex of mutual admiration and rivalry - undergoes multiple changes. Lila becomes less and less willing to engage with Lenu over her academic achievements, and focuses more and more on her work in the Cerullo shoe repair shop, while Lenu continues in her studies and begins to experience success. How do you think Lila and Lenu perceive their friendship? Is it more friendship or rivalry at this point? Do you think either of the girls feels superior or inferior to the other?\n\nThere are also the first signs of a romantic or sexual awakening, and Lenu mentions repeatedly to what extent each of them receive male attention, the fact that Lila has not yet received a declaration of love or been kissed, but also the fact that Lila (at 14) receives a serious marriage proposal - a very much unwanted one. At one point Lenu is bragging about her academic success and Lila replies simply with the news that she got her period. Do these physical changes and romantic developments factor into the admiration/rivalry relation between the girls? Do you think Lenu is jealous of Lila, or the other way around?\n\n\\* 2. The environment: We see the first forays outside of the neighborhood. Lila, Lenu and some of the neighborhood boys go to downtown Naples, Lenu goes to high school outside the neighborhood, and later Lenu goes to Ischia. These other settings contrast strongly with the violent, familiar setting of the neighborhood around the *Stradone*. Did your understanding of the neighborhood — and its role in shaping Lila and Lenu — change as these other environments were introduced? What do you think downtown Naples represents to Lila and Lenu, respectively? There is implicit mention of social class and related issues. How do Lila and Lenu perceive their social class and their parents' place in society? Is there a longing to escape the world they come from? And do they both want that escape equally?\n\n\\* 3. The dissolving margins:  \nIn this section, we witness the first instance of what Lila later calls her experience of the \"dissolving margins\" — a moment of intense visual and emotional disorientation, where the boundaries of the world seem to blur and collapse. The description is very vivid, but it is left somewhat unclear what exactly is happening to Lila. What do you think is the cause of the dissolving margins? Do you read it as psychological — a panic attack, a dissociative moment, a symptom of trauma — or as something more symbolic? What's your understanding of what happens to Lila during these episodes?\n\n\\* 4. The Solaras:  \nLila says that she'd rather drown herself in the pond than marry Marcello Solara. When asked by Lenu about why she refused to even let him handle the shoes she made, she says she doesn't even want him to touch them. Where does this hatred for the Solaras come from? Is Lila repulsed by the Solara's capacity for violence (as she expresses for example when she tells Lenu about the sharpened metal rod in the trunk of the Solara's 1100, and as the Solaras themselves demonstrated when they shot at the people on the other balcony on New Year's Eve)? Do the Solaras represent to her something that is at the heart of the identity of the neighborhood, like social decay or lawlessness? Does Lila not want Marcello Solara to touch the shoes because she detests him and they are something dear to her, or does she anticipate that the Solaras might offer help or support, and she wants her achievement to stand alone, without the slightest influence of Solara money?\n\n\\* 5. The shoes:  \nOne of the most significant symbols in the story so far is the pair of shoes that Lila and Rino designed and made together. By the end of this section, the shoes are displayed in the window of the Cerullo shop, waiting for a potential buyer. What do you think the shoes mean to Lila, as opposed to Rino? Fernando Cerullo seems to think that the shoes are badly made, but is willing to show them to Marcello Solara in a bid to gain support from the Solaras. Rino decided to show the shoes to Fernando without consulting Lila. Do you think the shoes are finished, in Lila's eyes? Were they ever going to be finished? To what extent do you think Lila is serious about wanting to learn the shoemaker's trade?\n\n\\* 6. The role of language and education:  \nLenu often mentions that characters are either speaking in dialect, or in proper Italian. Dialect can be characterized as \"charming\" (as with Marcello Solara) or as something vulgar or crass; Italian can be characterized as proper and polite, or as almost haughty or elitist (as with Donato Sarratore). In the original Italian, to my knowledge, very little dialect is actually used; the Italian text, much like the English text, will say something like \"he said in *dialect*\" to show where dialect is being used, although some shorter phrases are given directly in dialect. Do you think it would have made sense to translate the dialect passages into a lower sociolect of English? Do you \"visualize\" the characters speaking differently - in your mind, do people sound differently? The book is written from the perspective of Lenu in her 60s or 70s; we don't yet know where she ended up in life, but we know he has received an education in multiple languages (apart from Italian and Napolitan, at this stage she knows Latin, Greek, and English). Do you think her writing style and her literary voice are a commentary on the role of language in the society her and Lila grew up in?  \nIs there an elitist or classist element to her narrating this story in \"proper\" Italian?\n\n\\* 7. The role of narration and memory:  \nContinuing from the last question - it is easy to become absorbed in the story and forget what position Lenu is narrating from - hunched over her computer in her apartment in her 60s or 70s, \"documenting\" everything about Lila, because Lila tried to *disappear*. We don't yet understand fully why she is doing this. Do you think there is an element of spite? How factual do you think these recollections are? Are these memories she narrates colored by a patina of age, maybe romanticized in retrospect? Do you ever feel that Lenu isn't telling the whole truth?\n\nAnd - finally - how are you enjoying the novel so far? Is it easy to keep pace with the read-along? Are you tempted to go faster? Is the novel what you expected? I know that I thought - don't ask me where I got this idea from - that Ferrante was sappy romance literature, bodice-ripper-adjacent, until I tried the Neapolitan Novels on a whim. Do you feel the novel is an easy read? To me it never feels particularly challenging or dense, but that's not to say that it lacks substance. Feel free to share any other personal observations, and thanks for being part of the read-along. Have a great weekend, everyone!", "created_utc": 1744444068.0, "author": "ksarlathotep", "subreddit": "TrueLit", "score": 21, "num_comments": 20}
{"id": "1k2tqlc", "title": "TrueLit Read-Along (My Brilliant Friend – Adolescence: Chapters 31–45)", "body": "Elena looks forward to seeing Nino in Ischia, but he’s distant when he arrives, especially around his father. One night, Nino takes Elena and Marisa out, and while Marisa is unimpressed, Elena is captivated. She later reflects that both Nino and Lila “drove her into darkness,” calling them similar. Does she truly like Nino, or is he just a substitute for Lila?\n\r\nNino opens up to Elena about his father, calling him a hypocrite and a manipulative womanizer. Yet Elena refuses to fully believe it until Donato assaults her. Is her disbelief due to distrust of Nino, longing for a stable father figure, or something else? And should Nino have done more to warn her?\n\r\nElena later notes that Donato and Nino don’t resemble each other physically. What might this detail mean?\n\r\nOn her birthday, Elena receives a letter from Lila that’s reminiscent of The Blue Fairy, a childhood story. Why does a letter about real events evoke a fairy tale? Lila describes fear, anger, and Marcello’s threats, but leaves out her secret meetings with Stefano. Why hide this from Elena? And why insist Elena be there when she gets in Stefano’s car?\n\r\nAfter accepting Stefano’s proposal, Lila confronts Marcello with no sign of the fear she had described. Was her letter just another piece of fiction? Did she really need Elena’s help, or was everything calculated?\n\r\nBack at school, Elena grows closer to Alfonso, still avoids Nino, and still feels disgusted about the incident with Donato. Seeing Donato again later reminds her of the copper pot explosion. Why? \n\r\nElena gets glasses but hides them, and when they break, Lila has Stefano fix them. Does this show friendship, or Lila’s control over Elena?\n\r\nElena longs for intellectual connection at school but finds none. She turns to Lila, who says education while so much suffering is going on in the world is useless, yet at the same time, she flaunts Stefano’s wealth. How is this wealth helping her cope with all the suffering?\n\r\nDespite rising hostility toward Lila, Elena still wants to be like her, even at the cost of her own progress. Why? \n\r\nAnd finally, why does Enzo, who barely interacted with the others, defend Lila so strongly in chapter 45?\r\n", "created_utc": 1745060540.0, "author": "LPTimeTraveler", "subreddit": "TrueLit", "score": 21, "num_comments": 10}
{"id": "1k4cy3z", "title": "General Discussion Thread", "body": "Welcome again to the TrueLit General Discussion Thread! Please feel free to discuss anything related and unrelated to literature.\n\n**Weekly Updates:** N/A", "created_utc": 1745240486.0, "author": "pregnantchihuahua3", "subreddit": "TrueLit", "score": 15, "num_comments": 55}
{"id": "1jyyavf", "title": "General Discussion Thread", "body": "Welcome again to the TrueLit General Discussion Thread! Please feel free to discuss anything related and unrelated to literature.\n\n**Weekly Updates:** N/A", "created_utc": 1744635693.0, "author": "pregnantchihuahua3", "subreddit": "TrueLit", "score": 14, "num_comments": 39}
{"id": "1jo2n3c", "title": "General Discussion Thread", "body": "Welcome again to the TrueLit General Discussion Thread! Please feel free to discuss anything related and unrelated to literature.\n\n**Weekly Updates:** N/A", "created_utc": 1743426099.0, "author": "pregnantchihuahua3", "subreddit": "TrueLit", "score": 16, "num_comments": 79}
{"id": "1k84gqi", "title": "TrueLit Read-Along (My Brilliant Friend – Adolescence: Chapters 46-62)", "body": "Hi all,\n\nAnd here we are. Thank you all for reading along until the end. I wanted to include questions I had when  reading these last few chapters, as well as incorporate some questions around overarching concepts/themes. \n\n1. In this final section, we continue to see Lenù's attraction and fascination with Nino Sarratore. This is clearly indicated through Lenù's words despite the fact that Nino Sarratore has obvious character flaws, such as when he felt threatened by Lenù's writing ability. \n\nLenù's relationship with Nino, in some ways, felt very similar to the beginning of the novel when Lila pushed Tina, Lenù's doll into the cellar. What other similarities are there between Lila and Nino? What do we think fuels Lenù's attraction to them? What might this signify, if anything, about the type of people Lenù is attracted to? What are the ways in which Lila and Nino are different?\n\n2. Throughout this book it is perceived that Lila is the \"Brilliant Friend\" given that it's told from the perspective of Lenù. However, on pg. 312 as the day of Lila's wedding, she and Lenù had a conversation about Lenù's continuing education. When Lenù stated that at some point \"school is over,\" Lila told her \"Not for you: you're my brilliant friend, you have to be the best of all, boys and girls.\" \n\nDid this shift your understanding or perspective of their relationship? What might this imply about Lila's viewpoint or acceptance/resignation about the life she chose?\n\n3. At the end of the book, Lila is in shock that the shoes she made with her brother Rino was on the feet of Marcello Solara. We've discussed in previous discussions about the significance of these shoes for Lila and what they might mean to her, whether it be a tangible creation of her own vision or symbolic of a future better life. We also know that Stefano bought the shoes first. \n\nWhat might this event signify in terms of Stefano's and Lila's relationship, what might this signify about Lila's influence within the relationship (in previous parts of the novel, Stefano appeared to do whatever it is that Lila wanted), and what might this signify about the realities of starting a new life in your existing neighborhood? Were there earlier signs of this prior to the shoe incident at the wedding? What does this imply about the deeper power dynamics within the neighborhood? \n\n4. Through Lenù's observations during Lila's wedding, we see her perspective of the realities neighborhood/life, and the cyclical patterns of marriage/family, violence, poverty, and the impulses/reactivity that take place within the community. \"...then a huge fight would erupt, and it would be the start of hatreds lasting months, years, and offenses and insults that would involve husbands, sons, all with an obligation to prove to mothers and sisters and grandmothers that they knew how to be men.\" \n\nWhat shifted within Lenù that shaped this perspective, and how/what events in her life may have influenced it? In the past chapters, we've seen Lila provide this type of observation or insight, but this time, it's from Lenù. Does this this represent a shift in the power dynamic between Lila and Lenù, as one has decided to stay in the neighborhood, and the other may have dreams outside of Naples? Are there other examples that show this shift in power dynamic? \n\nAnd finally 5. What might be the reasons why Lila's former teacher, Maestro Oliviero, did not want to see Lila? Do we believe that either Lila or Lenù knew the real reason or are they both truly oblivious? \n\nHope to continue these amazing conversations with *Solenoid*!", "created_utc": 1745641153.0, "author": "CatStock9136", "subreddit": "TrueLit", "score": 14, "num_comments": 15}
{"id": "1jtkoy1", "title": "General Discussion Thread", "body": "Welcome again to the TrueLit General Discussion Thread! Please feel free to discuss anything related and unrelated to literature.\n\n**Weekly Updates:** N/A", "created_utc": 1744030891.0, "author": "pregnantchihuahua3", "subreddit": "TrueLit", "score": 13, "num_comments": 63}
{"id": "1jqm9f3", "title": "If you were a senior highschool English teacher what five books would you assigned to your class to show them books aren’t always boring. And why", "body": "Paper towns by John green-To show that while yea High school is important at the time. It’s what you do after that is more important \n\nYounger by Pamala Redmond- to show no matter how old they get they can always make their dreams come true \n\nHigh fidelity by Nick Hornsby- relationships come and go. They can be full of fire but There will always someone else around the corner\n\nOn the road by Jack Kerouac-the chaos of youth gives way to adult responsibilities. But, that doesn't make the chaos pointless, unfulfilling, or wrong.\n\nAnd finally \n\nValley of the Dolls-for many reasons \n\n\nI think I need to add some of the books I did go through for context ➡️\nMacbeth\nEthan frome\nTo kill a mockingbird\nLord of the flies\nGrapes of wrath\n⬅️\nGood books it’s fine. But a lot of us in the class were incredibly board. And the reason I’m doing this is because my younger cousins who have the same teachers as I did are getting to read \n➡️\nThe hunger games\nEnders game \nWar of the worlds \n\n", "created_utc": 1743696043.0, "author": "THAToneGuy091901", "subreddit": "TrueLit", "score": 0, "num_comments": 35}
